Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId.IsValid
Verifies if this is a valid segment id.
Returns:
True if this is a valid segment id, otherwise false.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId.SegmentId
The segment identifier.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId.ElementId
The element id where this analytical segment belongs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId.#ctor(Autodesk.Revit.DB.ElementId,System.Int32)
Creates a valid segment id on the network.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId.#ctor
Creates a default invalid segment id on the network.
Since:
2024

Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId
Represents a unique identifier for one analytical segment in the network.
Since:
2024